app/controllers/main_controller.rb

SELECT "scraws".* FROM "scraws"
---
  def index
    vcheck
    @mains = Scraw.all